{
  "name": "Gerard Walsh",
  "phone": "082 497 8496",
  "email": "gerard@exegetic.biz",
  "linkedin": "https://za.linkedin.com/in/gerard-walsh-393075161",
  "tools": ["R", "Python", "C & C++", "Matlab", "SQL", "Linux", "Bash", "Git", "Docker", "Deep Learning Software environments (PyTorch, TensorFlow, NVIDIA toolkit)", "OpenCV"],
  "education": [
    {
      "institution": "University of Stellenbosch",
      "location": "Stellenbosch, South Africa",
      "qualification": "Masters in Mechatronic Engineering (Cum Laude)",
      "period": "2019",
      "details": "Thesis: Feasibility analysis of general-purpose single board computer for real-time execution of a visual object tracking algorithm, implemented in C++ utilizing OpenCV’s framework, for deployment on UAVs."
    },
    {
      "institution": "University of Stellenbosch",
      "location": "Stellenbosch, South Africa",
      "qualification": "Bachelors in Mechanical Engineering",
      "period": "2017",
      "details": "Thesis: Design, manufacture and calibration of a Bi-Axial strain device for testing mechanical properties of heart-valve tissue prosthesis."
    }
  ],
  "experience": [
    {
      "company": "Exegetic Analytics",
      "title": "Junior Data Scientist",
      "period": "2019/03-2019/06",
      "details": "Consult for various companies on Data Science tasks: Analytics, model creation and visualization in R & Python, database management in MySQL, Shiny app development, deployment & containerization with Docker."
    },
    {
      "company": "Fraunhofer IWU, Chemnitz, Germany",
      "title": "Computer Vision Research Intern",
      "period": "2018/09-2019/01",
      "details": "Literature review and critical analysis of state-of-the-art Computer Vision algorithms for Object Tracking, Detection, Pose Estimation and Stereo Vision. Assessment for industry usage based on robustness and speed. Working with various Computer Vision algorithms using TensorFlow, Caffe, Caffe2 utilizing programming languages Python, C++ and MATLAB. Creation and maintenance of software infrastructure including Docker images, NVIDIA GPU drivers/toolkits, virtual environments."
    }
  ],
  "about": [
    {
      "languages": "English, Afrikaans, German (A1).",
      "hobbies": "Swimming, Water polo, Yoga, Mountain-biking, self-development, automotive diy, motorsport."
    }
  ]
}